# LckObjs

## Description
Procedure LckObjs locks the selected objects. When an object is locked, it
may be copied or duplicated, but it may not be changed in any other way.

```pascal
PROCEDURE LckObjs;
```

```python
def vs.LckObjs():
    return None
```

## Examples
==== VectorScript ====
```pascal
SelectObj((C='Structure To Remain'));
LckObjs;
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* General Edit